src/test/artillery-primus-test.yml
  config:
    target: "ws://localhost:3000"
    phases:
      - duration: 10
        arrivalRate: 1000
    ws:
      # Ignore SSL certificate errors
      # - useful in *development* with self-signed certs
      rejectUnauthorized: false
  scenarios:
    - engine: "ws"
      flow:
        - send: "hello"
        - think: 1
        - send: "world"